[
  {
    "imageSrc": "https://i.imgur.com/CoVnGlu.png",

    "imageAlt": "Cities: Skylines Thai Localization Mod",

    "title": "Cities: Skylines Thai Localization Mod",

    "details": "This community-driven mod provides a complete Thai localization for Cities: Skylines.It involved developing C++ interfaces to dynamically replace in-game text, creating XML parsing tools to manage over 15,000 strings, and resolving font rendering issues for Thai script compatibility, ensuring seamless UI integration across game updates.",

    "links": [
      {
        "label": "Steam Workshop",

        "url": "https://steamcommunity.com/sharedfiles/filedetails/?id=2920706399"
      },

      {
        "label": "GitHub",

        "url": "https://github.com/Nasz/Cities-Skylines-Thai-Mod"
      }
    ]
  },

  {
    "imageSrc": "https://i.imgur.com/u5xqsZd.jpeg",

    "imageAlt": "Style-War: Real-Time CSS Battle Platform",

    "title": "Style-War: Real-Time CSS Battle Platform",

    "details": "Style-War is a competitive coding website where users duel via CSS challenges with live previews and leaderboards. Built with Next.js 14 and Mantine UI, it features real-time code previews and leaderboards powered by WebSocket APIs. A Go backend handles live score updates, while Clerk provides secure OAuth2 authentication. PostgreSQL is used to track user coding input, and Monaco Editor with CSS linting streamlines the challenge experience.",

    "links": [
      {
        "label": "GitHub",

        "url": "https://github.com/stamford-syntax-club/style-war"
      }
    ]
  },

  {
    "imageSrc": "https://img2.pic.in.th/pic/imagef0d8e2f046b4d20b.png",

    "imageAlt": "MySpotifyTaste",

    "title": "MySpotifyTaste",

    "details": "A full-stack web application that analyzes and visualizes Spotify listening habits through the Spotify Web API. The frontend is built with Next.js, styled using Tailwind CSS and Radix UI, while the backend uses GoLang for efficient data processing and API handling",

    "links": [
      {
        "label": "GitHub",

        "url": "https://github.com/NayHtetKyaw/mySpotifyTaste"
      }
    ]
  }
]
